"+ Add" = "+ lisa";

"Add US bank account" = "Lisa Ameerika Ühendriikide pangakonto";

"Add a card" = "Kaardi lisamine";

"Add a payment method" = "Lisa makseviis";

"Add bank account" = "Lisa pangakonto";

"Add card" = "Kaardi lisamine";

"Add new card" = "Uue kaardi lisamine";

"Add new payment method" = "Lisage uus makseviis";

"Add your payment information" = "Lisage makseteave";

"Approve payment" = "Kinnitage makse";

"Are you sure you want to remove this card?" = "Kas olete kindel, et soovite selle kaardi eemaldada?";

"Are you sure you want to remove this linked account?" = "Kas olete kindel, et soovite selle lingitud konto eemaldada?";

"Back" = "Tagasi";

"Bank" = "Pank";

"Bank account" = "Pangakonto";

"Bank account details cannot be changed." = "Pangakonto andmeid ei saa muuta.";

"Buy now or pay later with  <img/>" = "Osta kohe või maksa hiljem makseviisiga <img/>";

"Buy now or pay later with Afterpay" = "Osta praegu või maksa Afterpay abil hiljem";

"Buy now or pay later with Cash App Afterpay" = "Osta praegu või maksa Cash App Afterpay abil hiljem";

"Buy now or pay later with Clearpay" = "Osta praegu või maksa Clearpay abil hiljem";

"Buy now or pay later with Klarna" = "Ostke nüüd või makske hiljem Klarnaga";

"Buy using a UPI ID" = "UPI ID abil ostmine";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "PayPaliga makset kinnitades lubate %@-l võtta teie PayPali kontolt tulevaste maksete eest tasu vastavalt nende tingimustele.";

"By continuing to Amazon Pay, you allow %@ to charge your Amazon Pay account for future payments in accordance with their terms." = "Amazon Payga jätkates lubate %@ teie Amazon Pay kontot tulevaste maksete tegemiseks vastavalt nende tingimustele.";

"By continuing to Klarna, you allow %@ to charge your Klarna account for future payments in accordance with their terms and Klarna's terms. You can change this at any time in your Klarna app or by reaching out to %@." = "Klarnaga jätkates, lubate ettevõttel %1$@ oma Klarna kontot vastavalt tema tingimustele ja vastavalt Klarna tingimustele tulevasteks makseteks debiteerida. Saate seda igal ajal oma Klarna rakenduses või ettevõtte %2$@ poole pöördudes muuta.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "PayPali jätkates lubate %@1-l võtta teie PayPali kontolt tulevaste maksete eest tasu vastavalt nende tingimustele.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Makseviisiga Revolut Pay jätkates, lubate ettevõttel %@ oma Revolut Pay kontot tulevasteks makseteks vastavalt nende tingimustele debiteerida.";

"By continuing you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Jätkates, nõustute <terms>tingimuste</terms> ja <privacy>privaatsuseeskirjadega</privacy>.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Jätkates nõustute maksete autoriseerimisega vastavalt nendele <terms>tingimustele</terms>.";

"By continuing, you agree to save your information for future purchases with %@ and <link>Link</link> according to Link <terms>terms</terms> and <privacy>privacy</privacy>." = "Jätkates nõustute salvestama oma andmed tulevaste ostude jaoks %@ ja <link>Link</link> vastavalt Linki <terms>tingimustele</terms> ja <privacy>privaatsusele</privacy>.";

"By continuing, you agree to save your information for future purchases with %@." = "Jätkates nõustute salvestama oma teabe tulevaste ostude jaoks %@.";

"By continuing, you authorize %@ to automatically debit your Satispay Balance on a recurring basis in accordance with your purchase or subscription plan." = "Jätkates annate loa, et %@ debiteerib regulaarselt teie Satispay Balance'i kontot vastavalt teie ostule või tellimusplaanile.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Jätkamisel volitate %1$@ debiteerima teie Cash Appi kontot selle makse ja tulevaste maksete eest vastavalt ettevõtte %2$@ tingimustele, kuni see volitus tühistatakse. Saate seda igal ajal oma Cash rakenduse seadetes muuta.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Link liitudes nõustute <terms>tingimuste</terms> ja <privacy>privaatsuseeskirjadega</privacy>.";

"By providing phone number and email, you agree to create a Link account subject to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Telefoninumbri ja e-posti aadressi esitamisega nõustute Linki konto loomisega vastavalt Linki <terms>tingimustele</terms> ja <privacy>privaatsuseeskirjadele</privacy>.";

"By providing your bank account details and confirming this payment, you agree to this Direct Debit Request and the <terms>Direct Debit Request service agreement</terms>, and authorise Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID number 507156 (“Stripe”) to debit your account through the Bulk Electronic Clearing System (BECS) on behalf of %@ (the \"Merchant\") for any amounts separately communicated to you by the Merchant. You certify that you are either an account holder or an authorised signatory on the account listed above." = "Esitades oma pangakonto andmed ja kinnitades selle makse, nõustute selle otsekorralduse taotluse ja <terms>otsekorralduse taotluse teenuselepinguga</terms> ning volitate Stripe Payments Australia Pty Ltd ACN 160 180 343 otsekorralduse kasutajatunnuse numbrit 507156 („Stripe“) debiteerima teie kontot hulgielektroonilise arveldussüsteemi (BECS) kaudu %@ („kaupmees“) nimel mis tahes summade eest, mille kaupmees on teile eraldi teatanud. Kinnitate, et olete ülaltoodud konto konto omanik või allkirjaõiguslik isik.";

"By providing your card information, you allow %@ to charge your card for future payments in accordance with their terms." = "Kaarditeavet esitades, lubate ettevõttel %@ oma kaarti tulevasteks makseteks nende kehtestatud tingimustel debiteerida.";

"By providing your email, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Oma e-posti aadressi esitamisega nõustute looma Linki konto ja salvestama oma makseteabe Linki, mille suhtes kehtivad Linki <terms>tingimused</terms> ja <privacy>privaatsuseeskirjad</privacy>.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Makseteabe esitamise ja käesoleva makse kinnitamisega volitatate (A) ettevõtet %@ ja Stripe'i, meie makseteenuse osutajat, saatma teie panka juhiseid teie konto debiteerimiseks ning (B) oma panka nende juhiste alusel teie kontot debiteerima. Vastavalt teie õigustele, pangaga sõlmitud lepingule ja panga üldtingimustele on teil õigus saada pangalt tagasimakset. Tagasimakse taotlus tuleb esitada 8 nädala jooksul alates teie konto debiteerimise kuupäevast. Teie õigusi selgitatakse avalduses, mille saate oma pangast. Nõustute saama teavitusi tulevaste debiteerimiste kohta kaks päeva enne nende toimumist.";

"By providing your phone number, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Oma telefoninumbri esitamisega nõustute looma Linki konto ja salvestama oma makseteabe Linki, mille suhtes kehtivad Linki <terms>tingimused</terms> ja <privacy>privaatsuseeskirjad</privacy>.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Salvestades oma pangakonto %@, nõustute maksete autoriseerimisega vastavalt nendele <terms>tingimustele</terms>.";

"By submitting your order to %@ and %@, you agree to save your information with %@ for future purchases, and agree to authorize payments pursuant to <terms>these terms</terms>." = "Esitades oma tellimuse %1$@ ja %2$@, nõustute salvestama oma andmed %3$@-ga tulevaste ostude jaoks ja nõustute autoriseerima makseid vastavalt <terms>nendele tingimustele</terms>.";

"By submitting your order to %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Esitades oma tellimuse aadressile %@, nõustute autoriseerima makseid vastavalt <terms>nendele tingimustele</terms>.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Tühista ja maksa muul viisil";

"Card details cannot be changed." = "Kaardi andmeid ei saa muuta.";

"Change" = "Muuda";

"Choose a payment method" = "Valige makseviis";

"Close card scanner" = "Kaardiskanneri sulgemine";

"Code sent" = "Kood saadetud";

"Confirm" = "Kinnita";

"Confirm it's you" = "Kinnitage, et see olete teie";

"Confirm payment details" = "Kinnitage makseandmed";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Ostu sooritamiseks kinnitage makse oma panga- või makserakenduses %@ jooksul.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Ostu sooritamiseks kinnitage makse oma pangarakenduses %@ jooksul.";

"Confirm your CVC" = "Kinnita CVC";

"Contact information" = "Kontaktandmed";

"Continue another way" = "Jätka muul viisil";

"Create an account with Link for faster checkout across the web" = "Looge Linki konto, et veebis kiiremini maksta";

"Debit or credit card" = "Deebet- või krediitkaart";

"Default" = "Vaikimisi";

"Default payment method" = "Vaikemakseviis";

"Did you mean %@? %@." = "Kas te pidasite silmas %1$@? %2$@.";

"EPS Bank" = "EPS pank";

"Enter address manually" = "Sisestage aadress käsitsi";

"Enter the code sent to %@." = "Sisestage kood, mis saadeti numbrile %s.";

"FPX Bank" = "FPX Bank";

"Failed to connect" = "Ühendamine ebaõnnestus";

"Fast, secure checkout" = "Kiire ja turvaline kassa";

"Get %@ back when you pay for the first time with your bank. <terms>See terms</terms>" = "Saate %@ tagasi, kui maksate esimest korda oma panga kaudu. <terms>Vaata tingimusi</terms>";

"Get %@ back when you pay with your bank. <terms>See terms</terms>" = "Saate %@ tagasi, kui maksate oma panga kaudu. <terms>Vaata tingimusi</terms>";

"I understand that Stripe will be collecting Direct Debits on behalf of %@ and confirm that I am the account holder and the only person required to authorise debits from this account." = "Mõistan, et Stripe kogub ettevõtte %@ nimel otsekorraldusi, ja kinnitan, et olen kontoomanik ja ainus isik, kes peab selle konto debiteerimist autoriseerima.";

"IBAN" = "IBAN";

"Log in or sign up" = "Logi sisse või registreeru";

"Log out of Link" = "Logi Link välja";

"Manage SEPA debit" = "SEPA deebeti haldamine";

"Manage US bank account" = "Ameerika Ühendriikide pangakonto haldamine";

"Manage bank account" = "Pangakonto haldamine";

"Manage card" = "Halda kaarti";

"Manage cards" = "Kaartide haldamine";

"Manage payment method" = "Makseviisi haldamine";

"Manage payment methods" = "Halda makseviise";

"Manage your payment methods" = "Makseviiside haldamine";

"Name on card" = "Nimi kaardil";

"New card" = "Uus kaart";

"New payment method" = "Uus makseviis";

"No %@ promo" = "%@ soodustus ei kehti";

"Not you?" = "Kas see pole teie?";

"Only card brand can be changed." = "Muuta saab ainult kaardi tootemarki.";

"Open your UPI app to approve your payment within %@" = "Makse kinnitamiseks avage oma UPI rakendus %@ jooksul";

"Or" = "Või";

"Or pay using" = "Või kasuta makseviisi";

"Or pay with a card" = "Või makske kaardiga";

"Or use" = "Või kasuta";

"Or use a card" = "Või kasuta kaarti";

"Pay %@" = "Maksa %@";

"Pay another way" = "Maksa muul viisil";

"Pay faster at %@ and thousands of businesses." = "Makske kiiremini kaupleja %@ lehel ja tuhandetel teistel saitidel.";

"Pay faster everywhere Link is accepted." = "Makske kiiremini kõikjal, kus Link on aktsepteeritud.";

"Pay over time with %@" = "Maksa aja jooksul makseviisiga %@";

"Pay over time with Affirm" = "Maksa Affirmi järelmaksuga";

"Pay with Link" = "Maksa Linkiga";

"Pay with your bank account in just a few steps." = "Pangakontoga maksmine vaid mõne sammuga.";

"Payment" = "Makse";

"Payment failed" = "Makse ebaõnnestus";

"Payment methods" = "Makseviisid";

"Please choose a valid payment method." = "Palun valige kehtiv makseviis.";

"Please go back and select another payment method" = "Minge tagasi ja valige mõni muu makseviis";

"Point the camera at your card." = "Suunake kaamera oma kaardile.";

"Processing..." = "Töötlemine ...";

"Przelewy24 Bank" = "Pank Przelewy24";

"Remove card?" = "Kas soovite kaardi eemaldada?";

"Remove linked account" = "Eemalda lingitud konto";

"Resend code" = "Saada kood uuesti";

"SEPA debit details cannot be changed." = "SEPA deebeti andmeid ei saa muuta.";

"Save" = "Salvesta";

"Save a new payment method" = "Uue makseviisi salvestamine";

"Save address" = "Salvesta aadress";

"Save for future payments" = "Salvestage tulevasteks makseteks";

"Save my info for faster checkout with Link" = "Salvesta minu andmed kiiremaks makse lõpuleviimiseks Linkiga";

"Save payment details to %@ for future purchases" = "Salvesta makseandmed %@ tulevaste ostude jaoks";

"Save this account for future %@ payments" = "Salvesta see konto tulevaste %@ maksete jaoks";

"Save your bank account in just a few steps." = "Salvestage oma pangakonto vaid mõne lihtsa sammuga.";

"Save your info for secure 1-click checkout with Link" = "Salvesta oma teave, et võimaldada turvaline ühe klõpsuga makse lõpuleviimine Linkiga";

"Saved" = "Salvestatud";

"Select card" = "Vali kaart";

"Select payment method" = "Vali makseviis";

"Select your payment method" = "Valige makseviis";

"Set as default" = "Muuda vaikimisi makseviisiks";

"Set as default payment method" = "Määra vaikimisi makseviisiks";

"Set up" = "Seadista";

"Shipping to %@ is not supported." = "Kohaletoimetamist %@ ei ole toetatud.";

"Show menu" = "Kuva menüü";

"Simple, secure one-click payments" = "Lihtsad turvalised maksed ühe hiireklõpsuga";

"Something went wrong when linking your account.\nPlease try again later." = "Konto linkimisel läks midagi valesti.\nProovige hiljem uuesti.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Stripe deponeerib teie pangakontole 0,01 dollarit 1–2 tööpäeva jooksul. Seejärel saate meili juhistega oma pangakonto %@ salvestamiseks.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Stripe deponeerib teie pangakontole 0,01 dollarit 1–2 tööpäeva jooksul. Seejärel saate meili juhistega makse sooritamiseks ettevõttele %@.";

"Tap to close" = "Puudutage sulgemiseks";

"Tap to expand" = "Puudutage laiendamiseks";

"The IBAN you entered is incomplete." = "Sisestatud IBAN on puudulik.";

"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "Sisestatud IBAN on kehtetu, „%@“ ei ole toetatud riigikood.";

"The provided verification code has expired." = "Esitatud tuvastuskood on aegunud.";

"The provided verification code is incorrect." = "Esitatud tuvastuskood on vale.";

"This is your default" = "See on teie vaikimisi makseviis";

"This payment method will be removed but will remain available for %@ subscriptions." = "See makseviis eemaldatakse, kuid jääb %@ kordustellimuste jaoks saadavale.";

"Too many attempts. Please try again in a few minutes." = "Liiga palju katseid. Proovige paari minuti pärast uuesti.";

"Unavailable for this purchase" = "Pole selle ostu puhul saadaval";

"Update card" = "Uuenda kaarti";

"Update payment method" = "Uuenda makseviisi";

"Use billing address for shipping" = "Kasutage saatmiseks arveldusaadressi";

"View more" = "Kuva rohkem";

"Yes, update" = "Jah, uuenda";

"Your IBAN should start with a two-letter country code." = "Teie IBAN peab algama kahetähelise riigikoodiga.";

"iDEAL Bank" = "iDEALi pank";
